import { Injectable } from '@angular/core';
import { Story } from '../models/story.model';

@Injectable({
  providedIn: 'root',
})
export class StoryService {
  constructor() {}

  getStories(): Story[] {
    return [
      {
        id: 'story-1',
        childName: 'יואב אביאל',
        title: 'מדוע קוראים לעץ הפיקוס כך?',
        text: `היתה מלחמה ששמה "חרבות ברזל". המחבלים היו חזקים, כי היו להם נשקים שלנו לא היו. היה מחבל אחד, ששמו פיקוס והיה שם עץ, שהמחבל רצה לירות בו, כי זה היה עץ ישראלי. המחבל ירה בו, אבל הכדור חזר אליו מגזע העץ והרג אותו. עברו שבעים שנה, הכריזו שעץ זה שמו יהיה פיקוס. `,
        backgroundImage: 'images/yoav-aviel-bg.jpg',
        childImage: 'images/yoav-aviel.png',
      },
      {
        id: 'story-2',
        childName: 'רז פורמן',
        title: 'מדוע עליו של עץ ההיביסקוס בצורת לב?',
        text: `בוקר אחד, עץ ההיביסקוס התעורר וחשב לעצמו: 'למה העלים שלי בצורת לב?'
העץ היה מאוד מוטרד למה דווקא לו יש עלים בצורת לב ולא בצורת עלה רגיל.
אז עברה חבורת ילדים, שצחקה והעץ שאל אותם אם הם יודעים מדוע עליו בצורת לב?
הם ענו להיביסקוס: "מאיפה לנו לדעת?! אולי בגלל שזה משהו טבעי?"
ענה להם ההיביסקוס: "לא חושב, אבל תודה."
ואז, סבא אחד עבר שם וההיביסקוס שאל אותו: "אולי אתה יודע למה העלים שלי בצורת לב?"
והסבא ענה: "אולי בגלל שמכשפה כישפה אותך?"
"לא, אני לא חושב ככה, תודה," ענה העץ.
ההיביסקוס הלך לישון, עדיין מוטרד מאוד.
פתאום, עבר שם מלך וההיביסקוס התרגש מאוד ושאל את המלך אותה שאלה.
המלך ענה: "כנראה בגלל שיש לך לב טוב".
ענה ההיביסקוס: "תודה רבה! אתה עזרת לי מאוד! בגלל זה העלים שלי בצורת לב!" `,
        backgroundImage: 'images/raz-furman-bg.jpg',
        childImage: 'images/raz-furman.png',
      },
      {
        id: 'story-3',
        childName: 'ניבה חדד',
        title: 'מדוע לעץ המייש קוראים מייש?',
        text: `היה היתה פעם משפחה: הורים ושני ילדים והם יצאו לטיול.
הם עצרו באמצע הטיול לאכול, הילדים שיחקו תופסת ופתאום שני הילדים נפלו לנחל הזורם.
לנחל היו שני צדדים: בצד אחד זרם חזק ובצד השני – זרם רגוע.
עץ אחד נפל ושני הילדים תפסו בו והעץ משה אותם לצד הרגוע של הנחל וכך הם ניצלו.
ולכן קוראים לעץ מייש, כי הוא משה את הילדים.
 `,
        backgroundImage: 'images/niva-hadad-bg.jpg',
        childImage: 'images/niva-hadad.png',
      },
      {
        id: 'story-4',
        childName: 'אורי סבג',
        title: 'מדוע עץ הקלמנטינה ירוק-עד?',
        text: `פעם, לפני שנים רבות, עץ הקלמנטינה היה ללא עלים כלל.
בחורף הוא היה קופא, אומלל בלילות.
יום אחד, ישבה ילדה מתחת לענפיו ובכתה.
העץ שאל אותה: "למה את בוכה?"
והיא ענתה: "כולם צוחקים עליי."
"למה הם צוחקים עליך?" שאל העץ.
היא ענתה בבכי: "כי אין לי בגדים יפים כמו כולם."
"אל תדאגי," אמר העץ, "את כמוני".
"אבל אתה הרי עץ!" אמרה הילדה.
"נכון, אבל גם לי אין עלים ואני לא כמו כולם..."
ואז הדמעה האחרונה שזלגה מעיניה – זלגה על גזעו של העץ והתחילו לצמוח עלים ירוקים ויפים.
יום למחרת, אמה של הילדה הפתיעה אותה בבגדים חדשים ויפים ומאז אותו היום, הילדה באה לבקר את עץ הקלמנטינה והוא כבר ירוק לתמיד, ירוק-עד.
`,
        backgroundImage: 'images/ori-sabag-bg.jpg',
        childImage: 'images/ori-sabag.png',
      },
      {
        id: 'story-5',
        childName: ' נויה לוי',
        title: 'מדוע לעץ פומלה קוראים פומלה?',
        text: `פעם, לפני שנים רבות, היתה אישה ששמה פומלה. היא הלכה לחנות בשם "עצים חדשים". כשהיא נכנסה לחנות, היא לא ידעה באיזה שתיל של עץ לבחור. היא ביקשה עזרה מהמוכר שיעזור לה. המוכר בחר לה שתיל ואמר לדאוג לעץ ולתת לו שם.
כשפומלה חזרה לביתה, היא הלכה לשתול את השתיל ולהשקות אותו.
ימים רבים עברו עד שגדל לעץ.
יום אחד, פומלה לא הרגישה טוב בלילה והיא הלכה לנשום אוויר ונרדמה תחת העץ. בבוקר, היא לא התעוררה, עד שאחד מחבריה בא לחפש אותה ומצא אותה מתה מתחת לעץ. הוא היה עצוב מאוד והחליט לבחור לעץ שם.
"שמך יהיה פומלה", אמר, "על שם חברתך, שנפטרה תחתיך" וכך העץ קיבל את שמו.
`,
        backgroundImage: 'images/noya-levi-bg.jpg',
        childImage: 'images/noya-levi.png',
      },
      {
        id: 'story-6',
        childName: 'איה כספי',
        title: 'מדוע עץ הזית ירוק?',
        text: `פעם, לפני שנים רבות, גרו בתוך גזע הזית גמדים: הגמד טוב-טוב ומשפחתו.
הם עברו לגור שם, כי הם מצאו את עץ הזית ואהבו לאכול את הזיתים.
לאחותו של טוב-טוב קראו טובה ולאבא שלו קראו טוב הנחמד. לאמא של טוב-טוב קראו טובי.
מרוב שהם אכלו המון זיתים, טוב-טוב וטוב הנחמד הפיקו שמן בצבע צהוב.
אמא טובי הכינה דגל ישראל כחול, כי הזית הוא עץ ישראלי.
ואז הם ערבבו את הכחול עם הצהוב ויצא ירוק.
ואז הגיעה פיה, שאהבה את הצבע הירוק שיצא להם ועשתה קסם וצבעה את עלי ופירות הזית בירוק.
הם החליטו לקרוא לעץ הזית – עץ ירוק זית.
`,
        backgroundImage: 'images/aya-kaspi-bg.jpg',
        childImage: 'images/aya-kaspi.png',
      },
      {
        id: 'story-7',
        childName: ` רון אלעד`,
        title: ` מדוע הלימון חמוץ?`,
        text: `לפני שנים רבות חי עץ אחד, היו לו פירות מתוקים וטעימים.
לעץ קראו – לימון.
ללימון נמאס להיות כמו כל שאר העצים, כי כולם אוכלים ממנו.
הגיע הלילה וכשקם בבוקר, הוא היה עדיין מתוק והמשיכו לאכול ממנו.
בלילה השני, הוא ראה משהו, זה היה מכשף, שהפך את פירותיו לחמוצים.
ומאז הוא חי באושר ועושר, כי לא אוכלים ממנו.
`,
        backgroundImage: 'images/ron-elad-bg.jpg',
        childImage: 'images/ron-elad.png',
      },
      {
        id: 'story-8',
        childName: `דניאל (דודו) מרקו`,
        title: `מדוע גזעו של עץ הזית מחוספס?`,
        text: `היה היה פעם עץ זית מחוספס והיו ילדים, שגירדו אותו עוד ועוד, עד שהוא הפך לחלק. הוא ביקש מהשמיים שיחזירו אותו להיות מחוספס.
עבר יום והשמיים הקשיבו לו והפכו אותו שוב למחוספס ושמו שער וגדר, שאף אחד לא יוכל יותר לגעת בו.
`,
        backgroundImage: 'images/daniel-marko-bg.jpg',
        childImage: 'images/daniel-marko.png',
      },
      {
        id: 'story-9',
        childName: `עמית נובק`,
        title: `מדוע עץ האלון חזק?`,
        text: `פעם, כשכדור הארץ נוצר, נוצר גם עץ האלון.
הוא היה חלש והגזע שלו היה דקיק.
ערב אחד, הוא ראה כוכב נופל. הכוכב התקרב אליו, עד ש...
הכוכב פגע באדמה ליד העץ והאלון החלש התמוטט ונפל.
חבריו הסנאים באו לעזור לו לקום והרימו אותו.
כשהגיע הלילה, האלון חלם שהוא חזק ועומד בפני כל דבר.
בערב שאחרי, האלון ראה שוב כוכב נופל וידע שהוא עומד ליפול. הוא ביקש בליבו שעכשיו יהיה חזק ועצם את עיניו.
כשפקח אותן, הוא ראה שלידו יש כוכב והוא נשאר עומד וראה שהגזע שלו התעבה.
ומאז ועד היום הוא נשאר אלון חזק.`,
        backgroundImage: 'images/amit-novak-bg.jpg',
        childImage: 'images/amit-novak.png',
      },
      {
        id: 'story-10',
        childName: 'דניאל ליברמן',
        title: 'מדוע עץ האלון מחוספס?',
        text: `פעם, עץ האלון הראשון היה חלק. כולם אהבו אותו ופתאום בא כורת עצים, שהיה זקוק לנייר. הוא ראה את עץ האלון ורצה את גזעו החלק. הוא התחיל להוריד את הגזע והעץ נשאר ערום ללא קליפת הגזע.
תחת קליפת הגזע, התגלה חלק מחוספס ומאז ועד היום – האלון מחוספס.`,
        backgroundImage: 'images/daniel-lieberman-bg.jpg',
        childImage: 'images/daniel-lieberman.png',
      },
      {
        id: 'story-11',
        childName: 'לביא שלו',
        title: 'מדוע השורשים של עץ הזית יוצאים ובולטים מן האדמה?',
        text: `היה היה פעם עץ זית, שחלם לצאת מן האדמה.
הוא ראה את הציפורים שעפות בשמיים ואת הפרפרים הקופצים מפרח לפרח ורצה גם לטייל בעולם, כמוהם.
החליט העץ שהוא יוצא לחופשי, התחיל למשוך את שורשיו, משך ומשך, אך גילה שכל משיכה כואבת וקשה עד מאוד. הזית החליט להפסיק באמצע.
ומאז, שורשיו של הזית בחוץ רק בחציים.`,
        backgroundImage: 'images/lavi-shalev-bg.jpg',
        childImage: 'images/lavi-shalev.png',
      },
      {
        id: 'story-12',
        childName: 'איילה שומינוב',
        title: 'מדוע הברוש גבוה?',
        text: `פעם, לפני שנים רבות, היה עץ הברוש הכי נמוך, כך שאפילו ארנבים יכלו לאכול את עליו.
יום אחד נשא עץ הברוש תפילה אל השמיים, שהוא יהיה בגובה ממוצע כמו רוב העצים.
אלוהים הגשים את חלומו והוא הפך לעץ ממוצע בגובהו בעל עלים יפים וקטנים.
הברוש שקע בשינה עמוקה למשך שלושה ימים וכשהוא התעורר, גבה בשני מטרים.
שמח מאוד עץ הברוש, אבל אז הגיעה חבורת ג'ירפות למקום והן אכלו את כל עליו.
בכה העץ ונשא תפילה נוספת אל אלוהים, שהפעם הוא יהיה הכי גבוה, שאף אחד לא יוכל לאכול את עליו.
אלוהים הגשים שוב את תפילתו. הברוש שוב ישן במשך שלושה ימים וכשהוא התעורר, הוא היה לעץ הגבוה ביותר.`,
        backgroundImage: 'images/ayala-shuminov-bg.jpg',
        childImage: 'images/ayala-shuminov.png',
      },
      {
        id: 'story-13',
        childName: 'הללי דהן',
        title: 'מדוע לפקאן יש אגוזים?',
        text: `לפני שנים רבות, כיתה ג'1 יצאה לטייל והם ראו את עץ הפקאן.
המורה שאלה: "למה לפקאן יש אגוזים?"
אף אחד מהתלמידים לא ידע.
הם המשיכו לטייל ורק ילדה אחת נשארה ליד העץ. קראו לה הללי.
היא חיבקה את העץ ואמרה: "אני אוהבת אותך עץ".
ואז היא הצטרפה והמשיכה לטייל עם כל הכיתה.
כעבור זמן רב, הללי אמרה למורה: "אני מתעניינת עדיין למה לפקאן יש אגוזים ואני רוצה לחזור לעץ."
המורה הסכימה שכל הכיתה תחזור לעץ הפקאן. כל התלמידים התבוננו בו וחשבו וחשבו ועדיין לא ידעו, אבל אמרו לעצמם: "לא משנה מה הסיבה, אנחנו תמיד נאהב את העץ".
`,
        backgroundImage: 'images/haleli-dahan-bg.jpg',
        childImage: 'images/haleli-dahan.png',
      },
      {
        id: 'story-14',
        childName: 'ליבי מויז׳ס',
        title: 'מדוע העלים של הפלומריה הלבנה ענקיים?',
        text: `היה היה פעם עץ קטן עם ניצנים ועלים קטנים והוא היה נמוך.
עם הזמן הוא גדל, חוץ מהעלים. הוא רצה עלים כמו לאורן - עלי מחט.
עץ הפלומריה הלבנה הלך לישון וכשהוא קם בבוקר, היו לו עלי מחט, אבל אחר הצהריים הוא נידקר מהם - אאוץ! "הלוואי שהיו לי עלי צמר", הוא חשב לעצמו. העץ הלך לישון והוא קם בבוקר עם עלי צמר. יש! אבל אז, התחיל גשם והעלים נרטבו ואבדו את צורתם והנה הוא ערום. "הלוואי שהיו לי עלים גדולים וירוקים"... העץ הלך לישון וקם בבוקר עם עלים גדולים וירוקים בדיוק כמו שהוא רצה ולא שינה את עליו לעולם.`,
        backgroundImage: 'images/libi-moyzes-bg.jpg',
        childImage: 'images/libi-moyzes.png',
      },
      {
        id: 'story-15',
        childName: 'גפן בוזגלו',
        title: 'מדוע כליל החורש פורח כל כך מעט זמן בשנה?',
        text: `פעם לפני שנים רבות כליל החורש היה פורח כל השנה, כל הציפורים היו באות להתארח עליו, אבל לא כל הציפורים קיבלו את רשותו, את רוב הציפורים הוא היה מגרש בבושת פנים, בגלל זה קוראים לו כליל החורש, כי הוא הכליל את רוב הציפורים. (כליל החורש היה יהיר מאוד).
יום אחד התחפשה דמטר* לציפור זקנה ובאה אל כליל החורש. כליל החורש אמר לה להתרחק, הוא צעק עליה עלבונות ואמר לה שהיא מכוערת יותר מכל הציפורים האחרות, ואז היא התגלתה לו בצורתה האמיתית, יפת התואר.
היא קיללה את העץ בשל יהירותו ובמילים אלה היא אמרה: "תקולל אתה בשם יהירותך ולנצח תפרח רק מעט זמן מהשנה!"
בכה העץ והתחנן לסליחתה, אבל את שלה היא אמרה ולא חזרה בה.
וכך כליל החורש פורח רק מעט זמן מהשנה.
*דמטר היא אלת החקלאות היוונית, אחותו של זאוס (מלך האלים), בת קרונוס וריה.
`,
        backgroundImage: 'images/geffen-buzaglo-bg.jpg',
        childImage: 'images/geffen-buzaglo.png',
      },
      {
        id: 'story-16',
        childName: 'נחשון הלל',
        title: 'מדוע הלימון צהוב?',
        text: `לפני שנים רבות, היה עץ הלימון בצבע ירוק ואז פתאום מכשפה טובה הפכה אותו לצהוב, כי היא רצתה שהוא יהיה זוהר ובולט.
הלימון שמח מאוד והמכשפה הטובה המשיכה לעצים אחרים.`,
        backgroundImage: 'images/nachshon-halel-bg.jpg',
        childImage: 'images/nachshon-halel.png',
      },
      {
        id: 'story-17',
        childName: 'נדב שטנגל',
        title: 'מדוע הלימון צהוב?',
        text: `קוף הלך בבוקר לטייל ואז פתאום הוא ראה עץ שלא ראה מימיו וזה היה עץ הלימון.
הוא לא הבין למה פרי הלימון צהוב.
הקוף חשב שזה בגלל ההשתקפות של השמש.
מה אתם חושבים?`,
        backgroundImage: 'images/nadav-shtangl-bg.jpg',
        childImage: 'images/nadav-shtangl.png',
      },
      {
        id: 'story-18',
        childName: 'רותם ברונר',
        title: 'מדוע לעץ האשכולית קוראים אשכולית?',
        text: `יום אחד איש ראה עץ והוא רצה לקחת את פירות שלו.
הוא קטף ולקח הביתה את הפירות ובדרך הביתה, נעצר, כי הפירות היו יותר מדי כבדים לו.
הוא מצא שק גדול, הכניס את כל הפירות וגרר את השק לביתו.
כשהוא הגיע הביתה, הוא ביקש עזרה מהמשפחה שלו, שיבואו ויעזרו לו לסחוב את הפירות הכבדים.
ובשפה שלהם, המילה "אשכולית" פירושה "כבד מאוד" וכל אחד מהמשפחה, שסחב, אמר "אשכולית, אשכולית" ומכאן שמו של העץ.`,
        backgroundImage: 'images/rotem-bruner-bg.jpg',
        childImage: 'images/rotem-bruner.png',
      },
      {
        id: 'story-19',
        childName: 'נגה אורבך',
        title: 'מדוע לעץ האלון יש עלים קוצניים?',
        text: `פעם אחת עץ האלון היה ממש מסכן, כולם צחקו עליו והוא נעלב, אז הוא הלך לביתו של חברו – הקיפוד.
הוא דפק בדלת, הדלת נפתחה והאלון שאל את הקיפוד: "תגיד לי קיפוד, איך זה שכולם מפחדים ממך?"
הקיפוד הסביר לו שכולם מפחדים ממנו, בגלל הקוצים שלו.
האלון ביקש מהקיפוד שילמד אותו איך הוא קוצני והקיפוד הסכים.
אז הקיפוד לימד אותו ואחרי כמה וכמה שיעורים, לאלון סוף כל סוף היו עלים קוצניים ועכשיו אף אחד לא צוחק עליו יותר.`,
        backgroundImage: 'images/noga-orbach-bg.jpg',
        childImage: 'images/noga-orbach.png',
      },
      {
        id: 'story-20',
        childName: 'עמרי הנדל',
        title: 'מדוע לכליל החורש יש פרחים ורודים?',
        text: `יום אחד לכליל החורש היה משעמם, אז הוא ניסה להעסיק את עצמו, אבל הוא לא הצליח ובאותו יום של שיעמום, בא מכשף וכליל החורש הבחין בו.
הוא חשב שהוא יוכל לבקש מהמכשף משאלה.
הוא ביקש מהמכשף, אבל המכשף אמר שהוא לא מגשים משאלות לאף אחד.
כליל החורש התחנן בפניו שיגשים את משאלתו, כי הוא ממש משועמם.
המכשף אמר בפעם השנייה שהוא לא מגשים משאלות לאף אחד.
כליל החורש ביקש "בבקשה" והמכשף החליט להפוך את הפרחים שלו לוורודים.
כל העצים האחרים צחקו עליו וכליל החורש בכה, אבל בסוף הוא הסתדר והעצים התחרטו על הצחוק ואמרו לו שהפרחים יפים וכליל החורש חי באושר עד עצם היום הזה.`,
        backgroundImage: 'images/omri-hendel-bg.jpg',
        childImage: 'images/omri-hendel.png',
      },
      {
        id: 'story-21',
        childName: 'אור רש',
        title: 'מדוע לאלון יש גזע עבה?',
        text: `לאלון יש גזע עבה, בגלל שהוא כבד והוא צריך גזע עבה, כי אם יהיה לו גזע דק – הוא ייפול.
אולי אלוהים הוא זה שיצר לו גזע עבה.`,
        backgroundImage: 'images/or-resh-bg.jpg',
        childImage: 'images/or-resh.png',
      },
      {
        id: 'story-22',
        childName: 'אדם סטיקלרו',
        title: 'מדוע לעץ האלון קוראים אלון?',
        text: `פעם היה כלב בשם אלון. הכלב אהב את העץ והעץ אהב את הכלב.
הכלב אלון והעץ היו חברים טובים מאוד. הם היו כל הזמן ביחד. העץ נתן לכלב אוכל ומים והכלב נתן לעץ מים.
הם טיילו בכל מקום ביחד והם הלכו ליער הסוללים ונהנו.
יום אחד, באו אנשים מכלבייה ולקחו את אלון הכלב, העץ היה מאוד עצוב והחליט לקרוא לעצמו אלון – על שם חברו הטוב ומאז זהו שמו.`,
        backgroundImage: 'images/adam-stikleru-bg.jpg',
        childImage: 'images/adam-stikleru.png',
      },
      {
        id: 'story-23',
        childName: 'דור צדוק',
        title: 'מדוע לעץ התפוז הסיני יש גזע עבה?',
        text: `עץ תפוז סיני היה לבד ואז הגיעה אליו מכשפה רעה, שעשתה עליו כישוף והפכה את הגזע שלו לצר במיוחד, כדי שהוא ייפול ברוח.
אז הגיעה מכשפה טובה והיא עשתה כישוף טוב והפכה את הגזע של העץ לעבה יותר.`,
        backgroundImage: 'images/dor-tsadok-bg.jpg',
        childImage: 'images/dor-tsadok.png',
      },
      {
        id: 'story-24',
        childName: 'מיקה הוד',
        title: 'מדוע הלימון צהוב?',
        text: `היה היה פעם עץ לימון, שהוא היה עץ שמח וכייפי ותמיד עזר לכל העצים האחרים. היו לו פירות לבנים.
השמש, שהיתה מעליו, אהבה לראות עץ כל כך שמח, שתמיד עוזר לאחרים ועושה כייף לכולם והיא החליטה להעניק לו מתנה: היא תיתן לו מהצבע שלה לפירות שלו ומאז הלימונים של הלימון הם בצבע צהוב.`,
        backgroundImage: 'images/mika-hod-bg.jpg',
        childImage: 'images/mika-hod.png',
      },
      {
        id: 'story-25',
        childName: 'אמיר אפרת',
        title: 'מדוע קליפת הפרי של המקדמיה קשה?',
        text: `לפני שנים רבות, לעץ המקדמיה היו פירות עגולים, עסיסיים ומתוקים מאוד. כל הציפורים אהבו לזלול מפירות העץ והעץ נשאר ללא פירות, שיקשטו אותו.
התלונן העץ בפני שר העצים וביקש ממנו שישנה את קליפת הפרי, כך שתהיה קשה מאוד והציפורים לא יוכלו לנקר ולזלול את הפירות.
מאז, פירות המקדמיה עדיין יפים ועגולים, אך קליפתם קשה מאוד לפיצוח.`,
        backgroundImage: 'images/amir-ephrat-bg.jpg',
        childImage: 'images/amir-ephrat.png',
      },
      {
        id: 'story-26',
        childName: 'מעיין פומרנצבלום',
        title: 'מדוע קוראים לעץ תפוז דם כך?',
        text: `לעץ תפוז דם קוראים כך, כי יום אחד החליט אוגר רשע להשמיד את כל עצי התפוז. כעבור שבוע, הוא התחיל במשימתו להשמיד את כל עצי התפוז וכל העצים דיממו ולקחו אותם לבית חולים לעצים ואחרי כמה זמן, הרופאים הבינו שהדם כבר הפך להיות חלק בלתי נפרד מהתפוז ובגלל זה החליטו הרופאים לקרוא לפרי תפוז דם.`,
        backgroundImage: 'images/maayan-pomerenzblum-bg.jpg',
        childImage: 'images/maayan-pomerenzblum.png',
      },
      {
        id: 'story-27',
        childName: 'שחר קירשנר',
        title: 'מדוע הקלמנטינה כתומה?',
        text: `הקלמטינה היא כתומה, כי יואב, רותם, לביא, רז, דודו, נדב דנגור, מעיין חיון, מעיין.פ ואני שיחקנו בכדור כתום קטן – הכדור עף גבוה ורחוק רחוק ואז ירד ירד למטה ונתלה על עץ בשם קלמנטינה ומאז פירותיה כתומים כמו הכדור.`,
        backgroundImage: 'images/shahar-kirshner-bg.jpg',
        childImage: 'images/shahar-kirshner.png',
      },
      {
        id: 'story-28',
        childName: 'מעיין חיון',
        title: 'מדוע אין לעץ הטבבויה פירות?',
        text: `פעם, לפני שנים רבות, היו שני ילדים: לאחד קראו נועם ולשני – רז. לרז היה עץ תפוז (אז לא היו לו פירות, כמו שאנו מכירים היום) ולנועם היה עץ טבבויה. יום אחד, נועם ורז רבו במה לשחק. הם צעקו אחד על השני. הם צעקו כל-כך הרבה, עד שהתעייפו וכל אחד הלך לנוח מתחת לעץ שלו. נועם צחק על רז שלעץ שלו אין פרי. באותו הלילה, אלוהים שלח שני מלאכים. אחד מהם קטף את פירות עץ הטבבויה והשני, נתן פירות לתפוז. מאז, אין לטבבויה פירות.`,
        backgroundImage: 'images/maayan-hayun-bg.jpg',
        childImage: 'images/maayan-hayun.png',
      },
      {
        id: 'story-29',
        childName: 'דניאלה אבני',
        title: 'מדוע פרי הזית מר?',
        text: `פעם, לא מזמן, גר בתוך עץ הזית גמד. הגמד הזה אמר: "חום מסמן צבע מר ולכן הזית מר". חברו ששמע אותו, אמר לו: "אני חושב שחום מסמן דווקא שוקולד ושוקולד הוא הרי מתוק ולכן הזית בכלל מתוק."
וכך רבו השניים ולא הגיעו להחלטה. בסוף החליטו – נשאל כל גמד בסביבה. נשאל את שמוליק הגמד, מושיק הגמד, מיכאל ורפאל הגמדים. שאל ואת כולם. שמוליק ומושיק אמרו: "החלטנו שהזית מר". מיכאל ורפאל: "ואנחנו החלטנו שהוא יהיה בטעם מתוק."
יש בעיה, שלוש מול שלוש, שווה בשווה.
שאלו עוד גמד אחד, את דני הגמד והוא אמר: "אני חושב שזית יכול להיות בעל טעמים שונים, אבל רובם יהיו זיתים מרים".
ולכן פרי הזית מר, בגלל דני הגמד.`,
        backgroundImage: 'images/daniela-avni-bg.jpg',
        childImage: 'images/daniela-avni.png',
      },
      {
        id: 'story-30',
        childName: 'יהל סירקין',
        title: 'מדוע לכליל החורש פרחים ורודים?',
        text: `היה היו פעם שני ילדים: נחשון ואדם. הם שתלו שתילים של כליל החורש ואז כליל החורש של נחשון גדל והוציא פרחים לבנים ואילו של אדם, הוציא פרחים אדומים.
נחשון ואדם רצו שהצבע שלהם הוא זה שיהיה הצבע הקבוע של הפריחה של כליל החורש והתחילו לריב.
ואז יהל עברה שם והציעה להם להספיק לריב ופשוט לערבב את הצבעים היפים של הפרחים הלבנים עם האדומים.
נחשון ואדם הסכימו, ערבבו ונוצר ורוד יפה במיוחד ומאז צבע הפרחים של כליל החורש הוא ורוד.`,
        backgroundImage: 'images/yahal-sirkin-bg.jpg',
        childImage: 'images/yahal-sirkin.png',
      },
      {
        id: 'story-31',
        childName: 'נדב דנגור',
        title: 'מדוע הפירות של עץ הזית קטנים?',
        text: `בתקופת התנ''ך, נוח שלח את יונת השלום להביא ענף זית.
כשיונת השלום הגיעה לעץ הזית היא תלשה ענף זית, אבל היא לא הצליחה לעוף, בגלל שפירות עץ הזית היו גדולים וכבדים.
אז אלוהים הקטין את פירות הזית, בשביל שיונת השלום תוכל להביא את ענף עץ הזית לנוח, לתיבה.
ומאז ועד היום פירות הזית נשארו קטנים.`,
        backgroundImage: 'images/nadav-dangor-bg.jpg',
        childImage: 'images/nadav-dangor.png',
      },
    ];
  }
}
