import { Injectable } from '@angular/core';
import { Story } from '../models/story.model';

@Injectable({
  providedIn: 'root',
})
export class StoryService {
  constructor() {}

  getStories(): Story[] {
    return [
      {
        id: 'story-1',
        childName: 'יואב אביאל',
        title: 'מדוע קוראים לעץ הפיקוס כך?',
        text: `היתה מלחמה ששמה "חרבות ברזל". המחבלים היו חזקים, כי היו להם נשקים שלנו לא היו. היה מחבל אחד, ששמו פיקוס והיה שם עץ, שהמחבל רצה לירות בו, כי זה היה עץ ישראלי. המחבל ירה בו, אבל הכדור חזר אליו מגזע העץ והרג אותו. עברו שבעים שנה, הכריזו שעץ זה שמו יהיה פיקוס. `,
        backgroundImage: 'images/yoav-aviel-bg.jpg',
        childImage: 'images/yoav-aviel.png',
      },
      {
        id: 'story-2',
        childName: 'רז פורמן',
        title: 'מדוע עליו של עץ ההיביסקוס בצורת לב?',
        text: `בוקר אחד, עץ ההיביסקוס התעורר וחשב לעצמו: 'למה העלים שלי בצורת לב?'
העץ היה מאוד מוטרד למה דווקא לו יש עלים בצורת לב ולא בצורת עלה רגיל.
אז עברה חבורת ילדים, שצחקה והעץ שאל אותם אם הם יודעים מדוע עליו בצורת לב?
הם ענו להיביסקוס: "מאיפה לנו לדעת?! אולי בגלל שזה משהו טבעי?"
ענה להם ההיביסקוס: "לא חושב, אבל תודה."
ואז, סבא אחד עבר שם וההיביסקוס שאל אותו: "אולי אתה יודע למה העלים שלי בצורת לב?"
והסבא ענה: "אולי בגלל שמכשפה כישפה אותך?"
"לא, אני לא חושב ככה, תודה," ענה העץ.
ההיביסקוס הלך לישון, עדיין מוטרד מאוד.
פתאום, עבר שם מלך וההיביסקוס התרגש מאוד ושאל את המלך אותה שאלה.
המלך ענה: "כנראה בגלל שיש לך לב טוב".
ענה ההיביסקוס: "תודה רבה! אתה עזרת לי מאוד! בגלל זה העלים שלי בצורת לב!" `,
        backgroundImage: 'images/raz-furman-bg.jpg',
        childImage: 'images/raz-furman.png',
      },
      {
        id: 'story-3',
        childName: 'ניבה חדד',
        title: 'מדוע לעץ המייש קוראים מייש?',
        text: `היה היתה פעם משפחה: הורים ושני ילדים והם יצאו לטיול.
הם עצרו באמצע הטיול לאכול, הילדים שיחקו תופסת ופתאום שני הילדים נפלו לנחל הזורם.
לנחל היו שני צדדים: בצד אחד זרם חזק ובצד השני – זרם רגוע.
עץ אחד נפל ושני הילדים תפסו בו והעץ משה אותם לצד הרגוע של הנחל וכך הם ניצלו.
ולכן קוראים לעץ מייש, כי הוא משה את הילדים.
 `,
        backgroundImage: 'images/niva-hadad-bg.jpg',
        childImage: 'images/niva-hadad.png',
      },
      {
        id: 'story-4',
        childName: 'אורי סבג',
        title: 'מדוע עץ הקלמנטינה ירוק-עד?',
        text: `פעם, לפני שנים רבות, עץ הקלמנטינה היה ללא עלים כלל.
בחורף הוא היה קופא, אומלל בלילות.
יום אחד, ישבה ילדה מתחת לענפיו ובכתה.
העץ שאל אותה: "למה את בוכה?"
והיא ענתה: "כולם צוחקים עליי."
"למה הם צוחקים עליך?" שאל העץ.
היא ענתה בבכי: "כי אין לי בגדים יפים כמו כולם."
"אל תדאגי," אמר העץ, "את כמוני".
"אבל אתה הרי עץ!" אמרה הילדה.
"נכון, אבל גם לי אין עלים ואני לא כמו כולם..."
ואז הדמעה האחרונה שזלגה מעיניה – זלגה על גזעו של העץ והתחילו לצמוח עלים ירוקים ויפים.
יום למחרת, אמה של הילדה הפתיעה אותה בבגדים חדשים ויפים ומאז אותו היום, הילדה באה לבקר את עץ הקלמנטינה והוא כבר ירוק לתמיד, ירוק-עד.
`,
        backgroundImage: 'images/ori-sabag-bg.jpg',
        childImage: 'images/ori-sabag.png',
      },
      {
        id: 'story-5',
        childName: ' נויה לוי',
        title: 'מדוע לעץ פומלה קוראים פומלה?',
        text: `פעם, לפני שנים רבות, היתה אישה ששמה פומלה. היא הלכה לחנות בשם "עצים חדשים". כשהיא נכנסה לחנות, היא לא ידעה באיזה שתיל של עץ לבחור. היא ביקשה עזרה מהמוכר שיעזור לה. המוכר בחר לה שתיל ואמר לדאוג לעץ ולתת לו שם.
כשפומלה חזרה לביתה, היא הלכה לשתול את השתיל ולהשקות אותו.
ימים רבים עברו עד שגדל לעץ.
יום אחד, פומלה לא הרגישה טוב בלילה והיא הלכה לנשום אוויר ונרדמה תחת העץ. בבוקר, היא לא התעוררה, עד שאחד מחבריה בא לחפש אותה ומצא אותה מתה מתחת לעץ. הוא היה עצוב מאוד והחליט לבחור לעץ שם.
"שמך יהיה פומלה", אמר, "על שם חברתך, שנפטרה תחתיך" וכך העץ קיבל את שמו.
`,
        backgroundImage: 'images/noya-levi-bg.jpg',
        childImage: 'images/noya-levi.png',
      },
      {
        id: 'story-6',
        childName: 'איה כספי',
        title: 'מדוע עץ הזית ירוק?',
        text: `פעם, לפני שנים רבות, גרו בתוך גזע הזית גמדים: הגמד טוב-טוב ומשפחתו.
הם עברו לגור שם, כי הם מצאו את עץ הזית ואהבו לאכול את הזיתים.
לאחותו של טוב-טוב קראו טובה ולאבא שלו קראו טוב הנחמד. לאמא של טוב-טוב קראו טובי.
מרוב שהם אכלו המון זיתים, טוב-טוב וטוב הנחמד הפיקו שמן בצבע צהוב.
אמא טובי הכינה דגל ישראל כחול, כי הזית הוא עץ ישראלי.
ואז הם ערבבו את הכחול עם הצהוב ויצא ירוק.
ואז הגיעה פיה, שאהבה את הצבע הירוק שיצא להם ועשתה קסם וצבעה את עלי ופירות הזית בירוק.
הם החליטו לקרוא לעץ הזית – עץ ירוק זית.
`,
        backgroundImage: 'images/aya-kaspi-bg.jpg',
        childImage: 'images/aya-kaspi.png',
      },
      {
        id: 'story-7',
        childName: ` רון אלעד`,
        title: ` מדוע הלימון חמוץ?`,
        text: `לפני שנים רבות חי עץ אחד, היו לו פירות מתוקים וטעימים.
לעץ קראו – לימון.
ללימון נמאס להיות כמו כל שאר העצים, כי כולם אוכלים ממנו.
הגיע הלילה וכשקם בבוקר, הוא היה עדיין מתוק והמשיכו לאכול ממנו.
בלילה השני, הוא ראה משהו, זה היה מכשף, שהפך את פירותיו לחמוצים.
ומאז הוא חי באושר ועושר, כי לא אוכלים ממנו.
`,
        backgroundImage: 'images/ron-elad-bg.jpg',
        childImage: 'images/ron-elad.png',
      },
      {
        id: 'story-8',
        childName: `דניאל (דודו) מרקו`,
        title: `מדוע גזעו של עץ הזית מחוספס?`,
        text: `היה היה פעם עץ זית מחוספס והיו ילדים, שגירדו אותו עוד ועוד, עד שהוא הפך לחלק. הוא ביקש מהשמיים שיחזירו אותו להיות מחוספס.
עבר יום והשמיים הקשיבו לו והפכו אותו שוב למחוספס ושמו שער וגדר, שאף אחד לא יוכל יותר לגעת בו.
`,
        backgroundImage: 'images/daniel-marko-bg.jpg',
        childImage: 'images/daniel-marko.png',
      },
    ];
  }
}
